app/controllers/admin/clients_controller.rb

    def create
      @client = Client.new(params[:client])

      if @client.save
---
INSERT INTO `clients` (`created_at`, `name`, `telephone`, `updated_at`) VALUES ('2012-08-14 03:57:15', 'Company CO', '4833333333', '2012-08-14 03:57:15')

    def edit
      @client = Client.find(params[:id])
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1

    def update
      @client = Client.find(params[:id])

      if @client.update_attributes(params[:client])
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
UPDATE `clients` SET `name` = 'Company SA', `updated_at` = '2012-08-14 03:58:47' WHERE `clients`.`id` = 1

    def remove
      @client = Client.find(params[:id])
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1

    def destroy
      @client = Client.find(params[:id])
      @client.destroy
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` = 1 LIMIT 1
DELETE FROM `clients` WHERE `clients`.`id` = 1