app/controllers/users_controller.rb

INSERT INTO `users` (`admin`, `created_at`, `email`, `name`, `password_hash`, `password_salt`, `updated_at`) VALUES (0, '2012-08-16 02:08:24', 'rpontes@gmail.com', 'Ricardo Pontes', '79cab6680e2bac5b893cbfb29288b3b290fb099c', '713ed5060a6f9bc7c2d4cc69ff15cb6f6d314cec', '2012-08-16 02:08:24')
---
	def create
		@user = User.new(params[:user])

		if @user.save